# Toby Sax
## week 12 - 11/7/2023
### Python - Pandas Series and DataFrame

## Key Feastures of Pandas
 - fast and efficient DataFrame object with default and customized indexing
 - tools for loading data into in-memory data objects from different file formats
 - data alignement and integrated handling missing data
 - reshaping and pivoting of data sets
 - label-based slicing indexing and subsetting of large data sets
 - columns from a data structure can be deleted or inserted
 - group by data for aggregation andf transformations
 - high performanve merging anf joinging of data
 - time serires functionality

In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
pd.__version__

'1.0.5'

In [6]:
# Panda Series
# A Pandas Series is like a colum in a table,
# one-dimensional array holding data of any type
s = pd.Series(np.arange(10,51))
s

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
20    30
21    31
22    32
23    33
24    34
25    35
26    36
27    37
28    38
29    39
30    40
31    41
32    42
33    43
34    44
35    45
36    46
37    47
38    48
39    49
40    50
dtype: int32

In [7]:
s = Series(np.arange(10,51))
s

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
20    30
21    31
22    32
23    33
24    34
25    35
26    36
27    37
28    38
29    39
30    40
31    41
32    42
33    43
34    44
35    45
36    46
37    47
38    48
39    49
40    50
dtype: int32

In [8]:
type(s)

pandas.core.series.Series

In [10]:
s.index

RangeIndex(start=0, stop=41, step=1)

In [11]:
s = Series([10, 20, 30 ,40], index = ['w','x','y','z'])
s

w    10
x    20
y    30
z    40
dtype: int64

In [12]:
s['x']

20

In [13]:
s['w']

10

In [14]:
s = Series(np.array(['a','b','c','d']), index = np.arange(100,104))
s

100    a
101    b
102    c
103    d
dtype: object

In [15]:
s.index

Int64Index([100, 101, 102, 103], dtype='int64')

In [16]:
s.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [17]:
so = Series([2520,1122,937,847,713], index = ['USA', 'Russia', 'Germany', 'UK', 'France'])
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [18]:
so['USA']

2520

In [19]:
so[so > 800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [20]:
'France'in so

True

In [21]:
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [22]:
type(so)

pandas.core.series.Series

In [23]:
so_dict = so.to_dict()
so_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [24]:
so_from_dict = Series(so_dict)
so_from_dict

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [25]:
countries= ['Russia', 'France', 'Spain', 'Germany', 'USA', 'UK', 'Italy']

In [28]:
so2 = Series(so_dict, index=countries)
so2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [29]:
pd.notnull(so2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [30]:
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [31]:
so2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [32]:
len(so)

5

In [33]:
len(so2)

7

In [34]:
so + so2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [35]:
s

100    a
101    b
102    c
103    d
dtype: object

In [36]:
so.name= 'Summer Olympic'
so2.name= 'Summer Olympic'

In [37]:
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [38]:
so2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [39]:
so.index.name = 'Country'
so2.index.name= 'Country'

In [40]:
so

Country
USA        2520
Russia     1122
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [41]:
so2

Country
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [42]:
# DataFrame
# 2 dimensional data structure, like a 2 dimensional array
my_dict = {'cars': ['GMC', 'Toyota', 'Ford'], 'seats':[8,7,5]}

In [43]:
my_dict

{'cars': ['GMC', 'Toyota', 'Ford'], 'seats': [8, 7, 5]}

In [44]:
type(my_dict)

dict

In [45]:
df = DataFrame(my_dict)
df

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [46]:
data = {'Calories':[420,380,390],'Fruits':['Orange','Banana','Grape']}
df = pd.DataFrame(data)
df

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [47]:
df.describe

<bound method NDFrame.describe of    Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [48]:
df.info

<bound method DataFrame.info of    Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [49]:
# locate row
df.loc[0]

Calories       420
Fruits      Orange
Name: 0, dtype: object

In [50]:
d = df.loc[1]
d

Calories       380
Fruits      Banana
Name: 1, dtype: object

In [51]:
type(d)

pandas.core.series.Series

In [52]:
df

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [53]:
df.loc[[0,2]]

   Calories  Fruits
0       420  Orange
2       390   Grape

In [54]:
df.loc[0:2]

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [55]:
df.loc[0:1]

   Calories  Fruits
0       420  Orange
1       380  Banana

In [56]:
my_dict = { 'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000,2001,2002,2001,2002,2003],
          'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
df2= DataFrame(my_dict)

In [57]:
df2

    State  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [58]:
df2.head()

    State  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [59]:
df2.head(3)

  State  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [60]:
df.tail()

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [61]:
df2.tail(3)

    State  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [63]:
df3 = DataFrame(my_dict, columns=['year','State','pop']) # reorder the columns
df3

   year   State  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [65]:
df4 = DataFrame (my_dict, columns=['year','State','pop','debt'],index=['one','two','three','four','five','six'])
df4

       year   State  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [66]:
df4.columns

Index(['year', 'State', 'pop', 'debt'], dtype='object')

In [67]:
df4['State']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: State, dtype: object

In [68]:
df4['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [69]:
df4.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [70]:
df4

       year   State  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [71]:
df4.loc['three']

year     2002
State    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [72]:
df4['debt']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [73]:
df4['debt'] = 10.5

In [74]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [76]:
df4['debt'] = np.random.randint(5,10)

In [77]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5     8
two    2001    Ohio  1.7     8
three  2002    Ohio  3.6     8
four   2001  Nevada  2.4     8
five   2002  Nevada  2.9     8
six    2003  Nevada  3.2     8

In [78]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5     8
two    2001    Ohio  1.7     8
three  2002    Ohio  3.6     8
four   2001  Nevada  2.4     8
five   2002  Nevada  2.9     8
six    2003  Nevada  3.2     8

In [79]:
df4['debt'] = np.arange(6.0)

In [80]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [81]:
df4['debt'] = np.random.randn(6)

In [82]:
df4

       year   State  pop      debt
one    2000    Ohio  1.5 -0.590024
two    2001    Ohio  1.7  0.806846
three  2002    Ohio  3.6 -0.311729
four   2001  Nevada  2.4 -1.148278
five   2002  Nevada  2.9 -0.411417
six    2003  Nevada  3.2  0.673758

In [83]:
s = Series([-1.2,-1.5,-1.7],index=['two','four','five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [84]:
df4['debt']=s

In [85]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [87]:
df4['eastern']=df4['State']=='Ohio'

In [88]:
df4

       year   State  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [89]:
df4.columns

Index(['year', 'State', 'pop', 'debt', 'eastern'], dtype='object')

In [90]:
del df4['eastern']

In [91]:
df4

       year   State  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN